Podkova/src/InformationRegisters/НастройкиОтправкиЭлектронныхДокументовПоВидам/НастройкиОтправкиЭлектронныхДокументовПоВидам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтправкиЭлектронныхДокументовПоВидам</name>
  <resources>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаршрутПодписания</name>
    <type>
      <types>CatalogRef.МаршрутыПодписания</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяОтветнаяПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Формировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияФорматаУстановленаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнениеКодаТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресОтправителя</name>
    <comment>Адрес отправителя документов при прямом обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресПолучателя</name>
    <comment>Адрес получателя документов при прямом обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбменБезПодписи</name>
    <comment>Признак использования подписи при прямом обмене</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрикладнойВидЭД</name>
    <type>
      <types>DefinedType.ПрикладныеВидыЭлектронныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/УчетныеЗаписиЭДО/УчетныеЗаписиЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЗаписиЭДО</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеУчетнойЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочтаДляУведомлений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОжидатьИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНовыхПриглашениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОбОтветахНаПриглашения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНовыхДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНеОбработанныхДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОбОкончанииСрокаДействияСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаСоглашенияНаРоуминг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеСоглашенияНаРоуминг</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоглашенияНаРоуминг</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассивноеСоединениеFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПортFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПутьFTP</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>EmailОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НазначениеУчетнойЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеУчетнойЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновитьНастройкиУведомлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятыУсловияИспользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПрикладнойЭД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/СпособыОбменаЭД/СпособыОбменаЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОбменаЭД</name>
  <enumValues>
    <name>БыстрыйОбмен</name>
  </enumValues>
  <enumValues>
    <name>ЧерезFTP</name>
  </enumValues>
  <enumValues>
    <name>ЧерезКаталог</name>
  </enumValues>
  <enumValues>
    <name>ЧерезОператораЭДОТакском</name>
    <comment>Через оператора электронного документооборота Такском</comment>
  </enumValues>
  <enumValues>
    <name>ЧерезСервис1СЭДО</name>
  </enumValues>
  <enumValues>
    <name>ЧерезЭлектроннуюПочту</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЧерезВебРесурсБанка</name>
  </enumValues>
  <enumValues>
    <name>Через1СБизнесСеть</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Catalogs/МаршрутыПодписания/МаршрутыПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаршрутыПодписания</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОднойДоступнойПодписью</name>
      <description>Одной доступной подписью</description>
    </items>
    <items>
      <name>УказыватьПриСоздании</name>
      <description>Указывать при создании документа</description>
    </items>
  </predefined>
  <attributes>
    <name>СхемаПодписания</name>
    <type>
      <types>EnumRef.СхемыПодписанияЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючАвтоматическойНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодписи</name>
    <type>
      <types>EnumRef.ВидыЭлектронныхПодписей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаТребований</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Требование</name>
      <type>
        <types>EnumRef.ТребованияКПодписаниюЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Подписант</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Podkova/src/InformationRegisters/НастройкиОтправкиЭлектронныхДокументовПоВидам/Forms/НастройкиРегламентаПрямогоОбмена/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация"               , Организация);
	Параметры.Свойство("УчетнаяЗаписьПредставление", УчетнаяЗаписьПредставление);
	Параметры.Свойство("ИдентификаторОтправителя"  , ИдентификаторОтправителя);
	Параметры.Свойство("ИдентификаторПолучателя"   , ИдентификаторПолучателя);
	Параметры.Свойство("СпособОбмена"              , СпособОбмена);
	Параметры.Свойство("ВидДокумента"              , ВидДокумента);
	Параметры.Свойство("ПрикладнойВидЭД"           , ПрикладнойВидЭД);
	Параметры.Свойство("ВерсияФормата"             , ВерсияФормата);
	Параметры.Свойство("АдресПолучателя"           , АдресПолучателя);
	Параметры.Свойство("АдресОтправителя"          , АдресОтправителя);
	Параметры.Свойство("ИспользоватьПодпись"       , ИспользоватьПодпись);
	Параметры.Свойство("МаршрутПодписания"         , МаршрутПодписания);
	Параметры.Свойство("ОжидатьОтветнуюПодпись"    , ОжидатьОтветнуюПодпись);
	Параметры.Свойство("ОжидатьИзвещение"          , ОжидатьИзвещение);
	Параметры.Свойство("ЗаполнениеКодаТовара"      , ЗаполнениеКодаТовара);
	Параметры.Свойство("РасширенныйРежим"          , РасширенныйРежим);
	Параметры.Свойство("ВерсияФорматаУстановленаВручную", ВерсияФорматаУстановленаВручную);
	
	ЗаполнитьДанныеФормы();
	
	НастроитьОтображениеЭлементовФормы();
	
	СброситьРазмерыИПоложениеОкна();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭД.КонтекстныеПодсказки_ПриСозданииНаСервере(ЭтотОбъект, 
																		Элементы.ПанельКонтекстныхНовостей, 
																		Элементы.ГруппаКонтекстныхПодсказок);
	СформироватьКонтекст();
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)
	ПриИзмененииУчетнойЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиСлужебныйКлиент.ОткрытьФормуУчетнойЗаписиЭДО(ИдентификаторОтправителя);
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Идентификатор_Создать() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьПараметрыУчетнойЗаписиПослеСоздания", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	
	ОткрытьФорму("РегистрСведений.УчетныеЗаписиЭДО.Форма.УчетнаяЗаписьПрямогоОбмена",
		ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияФорматаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВерсияФорматаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВерсияФорматаУстановленаВручную Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("УстановитьВерсиюФорматаПослеВопроса", ЭтотОбъект, ВыбранноеЗначение);
	ТекстВопроса = НСтр("ru = 'В случае ручной корректировки будет отключен автоматический подбор формата, наиболее оптимального для обмена с выбранным контрагентом.
		|Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодписьПриИзменении(Элемент)
	
	Если Не ВидДокументаБезТитула Тогда
	ИначеЕсли ИспользоватьПодпись Тогда
		ОжидатьОтветнуюПодпись = ОжидатьОтветнуюПодписьПоУмолчанию(ВидДокумента);
	Иначе
		ОжидатьОтветнуюПодпись = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьНастроекПодписания(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьОтветнуюПодписьПриИзменении(Элемент)
	
	Если ОжидатьОтветнуюПодпись Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьОжиданиеОтветнойПодписиПослеПодтверждения", ЭтотОбъект);
	ОбменСКонтрагентамиСлужебныйКлиент.ЗапроситьПодтверждениеОтключенияОжиданияОтветнойПодписи(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеКодаТовараОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИЗакрыть(Команда)
	
	Если ЕстьОшибкиЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Организация"               , Организация);
	Результат.Вставить("СпособОбмена"              , СпособОбмена);
	Результат.Вставить("ВерсияФормата"             , ВерсияФормата);
	Результат.Вставить("УчетнаяЗаписьПредставление", УчетнаяЗаписьПредставление);
	Результат.Вставить("ИдентификаторОтправителя"  , ИдентификаторОтправителя);
	Результат.Вставить("ИдентификаторПолучателя"   , ИдентификаторПолучателя);
	Результат.Вставить("АдресПолучателя"           , АдресПолучателя);
	Результат.Вставить("АдресОтправителя"          , АдресОтправителя);
	Результат.Вставить("ИспользоватьПодпись"       , ИспользоватьПодпись);
	Результат.Вставить("МаршрутПодписания"         , МаршрутПодписания);
	Результат.Вставить("ОжидатьОтветнуюПодпись"    , ОжидатьОтветнуюПодпись);
	Результат.Вставить("ОжидатьИзвещение"          , ОжидатьИзвещение);
	Результат.Вставить("ЗаполнениеКодаТовара"      , ЗаполнениеКодаТовара);
	Результат.Вставить("ВерсияФорматаУстановленаВручную",
		ВерсияФорматаУстановленаВручную);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы();
	
	Если Не ЗначениеЗаполнено(МаршрутПодписания) Тогда
		МаршрутПодписания = Справочники.МаршрутыПодписания.ОднойДоступнойПодписью;
	КонецЕсли;
	
	ВидДокументаБезТитула = ОбменСКонтрагентамиСлужебный.ЭтоВидЭДБезТитула(ВидДокумента);
	
	НастройкиРегламентаЭДО = ОбменСКонтрагентамиСлужебный.НастройкиРегламентаЭДО(
		ВидДокумента, ВерсияФормата, СпособОбмена);
	РедактироватьОтветнуюПодпись = НастройкиРегламентаЭДО.РедактироватьОтветнуюПодпись;
	
	ЗаполнитьСписокУчетныхЗаписей();
	
	ЗаполнитьСписокФорматовПоВидуДокумента();
	
	ИнициализироватьВариантыЗаполненияПолей();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокУчетныхЗаписей()
	
	Если Не РасширенныйРежим Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.УчетнаяЗапись.СписокВыбора;
	СписокВыбора.Очистить();
	
	ОбменСКонтрагентамиСлужебный.ЗаполнитьСписокУчетныхЗаписейПрямогоОбмена(СписокВыбора, Организация);
	
	Если ПустаяСтрока(ИдентификаторОтправителя)
		И СписокВыбора.Количество() = 1 Тогда
		ИдентификаторОтправителя = СписокВыбора[0].Значение;
	КонецЕсли;
	
	СписокВыбора.Добавить(Идентификатор_Создать(), НСтр("ru = 'Создать новую учетную запись'"),,
		БиблиотекаКартинок.СоздатьЭлементСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФорматовПоВидуДокумента()
	
	СписокВыбора = Элементы.ВерсияФормата.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ФорматыЭлектронныхДокументов = ОбменСКонтрагентамиСлужебный.ФорматыЭлектронныхДокументов();
	
	Отбор = Новый Структура("Действует", Истина);
	Если ВидДокумента = Перечисления.ВидыЭД.ПрикладнойЭД Тогда
		Отбор.Вставить("ПрикладнойВидЭД", ПрикладнойВидЭД);
	Иначе
		Отбор.Вставить("ВидЭлектронногоДокумента", ВидДокумента);
	КонецЕсли;
	
	НайденныеСтроки = ФорматыЭлектронныхДокументов.НайтиСтроки(Отбор);
	Для Каждого СтрокаФормата Из НайденныеСтроки Цикл
		СписокВыбора.Добавить(СтрокаФормата.ИдентификаторФормата, СтрокаФормата.ПредставлениеФормата);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеЭлементовФормы()
	
	Элементы.ГруппаРасширенныйРежим.Видимость = РасширенныйРежим;
	
	Элементы.ГруппаВерсияФормата.Видимость = ВидДокумента <> Перечисления.ВидыЭД.ПроизвольныйЭД;
	
	Если Не ВидДокументаБезТитула Тогда
		Элементы.ОжидатьОтветнуюПодпись.Заголовок = НСтр("ru = 'Ожидать подтверждение получателем'");
	КонецЕсли;
	
	УстановитьОтображениеТранспортныхНастроек();
	
	УстановитьДоступностьНастроекПодписания(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеТранспортныхНастроек()
	
	Если Не РасширенныйРежим Тогда
		Элементы.АдресОтправителя.Видимость = Ложь;
		Элементы.АдресПолучателя.Видимость  = Ложь;
	ИначеЕсли СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту Тогда
		Элементы.АдресОтправителя.Видимость = Ложь;
		Элементы.АдресПолучателя.Заголовок  = НСтр("ru = 'Электронная почта получателя'");
	Иначе
		Элементы.АдресОтправителя.Видимость = Истина;
		Элементы.АдресОтправителя.Заголовок = НСтр("ru = 'Каталог отправителя'");
		Элементы.АдресПолучателя.Заголовок  = НСтр("ru = 'Каталог получателя'");;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьНастроекПодписания(Форма)
	Элементы = Форма.Элементы;
	Элементы.МаршрутПодписания.Доступность = Форма.ИспользоватьПодпись;
	Если Форма.ВидДокументаБезТитула Тогда
		Элементы.ОжидатьОтветнуюПодпись.Доступность = Форма.ИспользоватьПодпись
			И Форма.РедактироватьОтветнуюПодпись;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыУчетнойЗаписиПослеСоздания(УчетнаяЗапись, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОтправителя = УчетнаяЗапись.ИдентификаторЭДО;
	СпособОбмена = УчетнаяЗапись.СпособОбмена;
	
	НастроитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьВариантыЗаполненияПолей()
	
	ВариантыЗаполненияПолей = ОбменСКонтрагентамиВнутренний.ВариантыЗаполненияПолейЭлектронныхДокументов(
		ВидДокумента, ВерсияФормата);
	
	ЗначениеСвойства = Неопределено;
	Если ВариантыЗаполненияПолей.Свойство("ТоварКод", ЗначениеСвойства) Тогда
		Для Каждого Вариант Из ЗначениеСвойства Цикл
			ЗаполнитьЗначенияСвойств(Элементы.ЗаполнениеКодаТовара.СписокВыбора.Добавить(), Вариант);
		КонецЦикла;
	Иначе
		Элементы.ЗаполнениеКодаТовара.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииУчетнойЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетныеЗаписиЭДО.НаименованиеУчетнойЗаписи КАК НаименованиеУчетнойЗаписи,
		|	УчетныеЗаписиЭДО.Организация КАК Организация,
		|	УчетныеЗаписиЭДО.СпособОбменаЭД КАК СпособОбмена
		|ИЗ
		|	РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписиЭДО
		|ГДЕ
		|	УчетныеЗаписиЭДО.ИдентификаторЭДО = &ИдентификаторЭДО";
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторОтправителя);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	УчетнаяЗаписьПредставление = Выборка.НаименованиеУчетнойЗаписи;
	Организация = Выборка.Организация;
	
	Если Выборка.СпособОбмена = СпособОбмена Тогда
		Возврат;
	КонецЕсли;
	
	СпособОбмена = Выборка.СпособОбмена;
	АдресОтправителя = "";
	АдресПолучателя  = "";
	
	УстановитьОтображениеТранспортныхНастроек();
	
	СформироватьКонтекст();
	
КонецПроцедуры

&НаСервере
Функция ОжидатьОтветнуюПодписьПоУмолчанию(Знач ВидДокумента)
	
	НастройкаПоУмолчанию = Новый Структура("Формировать, ДокументУчета, ВидДокумента, ПрикладнойВидЭД, ВерсияФормата,
		|ТребуетсяИзвещениеОПолучении, ТребуетсяОтветнаяПодпись, МаршрутПодписания, Приоритет");
	Если ВидДокумента = Перечисления.ВидыЭД.ПрикладнойЭД Тогда
		ОбменСКонтрагентамиСлужебный.ЗаполнитьНастройкуПоПрикладномуВидуЭлектронногоДокумента(
			НастройкаПоУмолчанию, ВидДокумента);
	Иначе
		ОбменСКонтрагентамиСлужебный.ЗаполнитьНастройкуПоВидуЭлектронногоДокумента(НастройкаПоУмолчанию,ВидДокумента);
	КонецЕсли;
	
	Возврат НастройкаПоУмолчанию.ТребуетсяОтветнаяПодпись;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВерсиюФорматаПослеВопроса(Ответ, Значение) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВерсияФормата = Значение;
		ВерсияФорматаУстановленаВручную = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОжиданиеОтветнойПодписиПослеПодтверждения(Ответ, Контекст) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ОжидатьОтветнуюПодпись = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьОшибкиЗаполнениеРеквизитов(Выводить = Истина)
	
	ЕстьОшибки = Ложь;
	
	Если Не РасширенныйРежим Тогда
		Возврат ЕстьОшибки;
	КонецЕсли;
	
	ПроверитьЗначениеЗаполнено(Элементы.ИдентификаторОтправителя, Выводить, ЕстьОшибки);
	
	ПроверитьЗначениеЗаполнено(Элементы.ИдентификаторПолучателя, Выводить, ЕстьОшибки);
	
	ПроверитьЗначениеЗаполнено(Элементы.АдресПолучателя, Выводить, ЕстьОшибки);
	
	Если СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту Тогда
		ПроверитьКорректностьЭлектроннойПочты(Элементы.АдресПолучателя, Выводить, ЕстьОшибки);
	Иначе
		ПроверитьНедопустимыеСимволыВИмениФайла(Элементы.АдресПолучателя, Выводить, ЕстьОшибки);
		
		ПроверитьЗначениеЗаполнено(Элементы.АдресОтправителя, Выводить, ЕстьОшибки);
		ПроверитьНедопустимыеСимволыВИмениФайла(Элементы.АдресОтправителя, Выводить, ЕстьОшибки);
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗначениеЗаполнено(Элемент, Выводить, Отказ)
	
	ЗначениеРеквизита = ЭтотОбъект[Элемент.ПутьКДанным];
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если Выводить Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Поле ""%1"" не заполнено.'"), Элемент.Заголовок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Элемент.ПутьКДанным);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНедопустимыеСимволыВИмениФайла(Элемент, Выводить, Отказ)
	
	ЗначениеРеквизита = ЭтотОбъект[Элемент.ПутьКДанным];
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	НедопустимыеСимволы = ОбщегоНазначенияКлиентСервер.НайтиНедопустимыеСимволыВИмениФайла(ЗначениеРеквизита);
	Если НедопустимыеСимволы.Количество() Тогда
		Отказ = Истина;
		Если Выводить Тогда
			ШаблонТекста = НСтр("ru = 'Наименование папки содержит запрещенные символы (%1)'");
			ТекстСообщения = СтрШаблон(ШаблонТекста, СтрСоединить(НедопустимыеСимволы, " "));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Элемент.ПутьКДанным);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКорректностьЭлектроннойПочты(Элемент, Выводить, Отказ)
	
	ЗначениеРеквизита = ЭтотОбъект[Элемент.ПутьКДанным];
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ЗначениеРеквизита) Тогда
		Отказ = Истина;
		Если Выводить Тогда
			ТекстСообщения = НСтр("ru = 'Электронная почта указана не верно'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Элемент.ПутьКДанным);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьРазмерыИПоложениеОкна()
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Удалить("ОбщаяФорма.НастройкаРегламентаЭДО", "", ИмяПользователя);
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

#Область ТипыИдентификаторовУчетныхЗаписей

&НаКлиентеНаСервереБезКонтекста
Функция Идентификатор_Создать()
	Возврат "Создать";
КонецФункции

#КонецОбласти

#Область КонтекстныеПодсказки

&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";	
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостейОбработкаНавигационнойСсылки(Элемент, ПараметрНавигационнаяСсылка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОбработкаНовостейКлиент.ПанельКонтекстныхНовостей_ЭлементПанелиНовостейОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		ПараметрНавигационнаяСсылка,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостей_ЭлементУправленияНажатие(Элемент)
	
	КонтекстныеПодсказкиБЭДКлиент.ЭлементУправленияНажатие(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКонтекст(КатегорииПересчета = Неопределено)
	
	Если Не КонтекстныеПодсказкиБЭД.ФункционалКонтекстныхПодсказокДоступен() Тогда 
		Возврат;
	КонецЕсли;
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_ВидЭлектронногоДокумента();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.ЗначениеВидаЭД(ВидДокумента); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_КодОператораУчетнойЗаписиОрганизации();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.КодОператораУчетнойЗаписиОрганизации(Организация); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;

	
	КонтекстныеПодсказкиБЭД.ОтобразитьАктуальныеДляКонтекстаНовости(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти  

#КонецОбласти
